In [20]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [21]:
pstore = pd.read_csv("prctc2.csv")
pstore.head(10)

       country       state  litracy_rate  salaries
0     pakistan    peshawar            98     80000
1     pakistan   islamabad            99     80000
2        india      lahore            99     80000
3     pakistan      lahore            99     80000
4  afghanistan       kabul            65     50000
5  afghanistan    qandahar            65     50000
6        india       delhi            98     70000
7        dubai   abu dhabi            99    150000
8       bangla       dhaka            98     70000
9      england  manchester            99    100000

In [22]:
#groupby function just show one mean from duplicate entries/rows
pstore.groupby('country').salaries.mean()

country
afghanistan     50000
bangla          70000
dubai          150000
england        100000
india           75000
pakistan        80000
Name: salaries, dtype: int64

In [23]:
pstore.groupby('country').salaries.max()

country
afghanistan     50000
bangla          70000
dubai          150000
england        100000
india           80000
pakistan        80000
Name: salaries, dtype: int64

In [24]:
pstore.groupby('country').salaries.min()

country
afghanistan     50000
bangla          70000
dubai          150000
england        100000
india           70000
pakistan        80000
Name: salaries, dtype: int64

In [25]:
pstore.groupby('country').salaries.count()

country
afghanistan    2
bangla         1
dubai          1
england        1
india          2
pakistan       3
Name: salaries, dtype: int64

In [27]:
pstore.groupby('country').litracy_rate.count()

country
afghanistan    2
bangla         1
dubai          1
england        1
india          2
pakistan       3
Name: litracy_rate, dtype: int64

In [26]:
pstore.groupby('country').litracy_rate.describe()

             count       mean       std   min    25%   50%    75%   max
country
afghanistan    2.0  65.000000  0.000000  65.0  65.00  65.0  65.00  65.0
bangla         1.0  98.000000       NaN  98.0  98.00  98.0  98.00  98.0
dubai          1.0  99.000000       NaN  99.0  99.00  99.0  99.00  99.0
england        1.0  99.000000       NaN  99.0  99.00  99.0  99.00  99.0
india          2.0  98.500000  0.707107  98.0  98.25  98.5  98.75  99.0
pakistan       3.0  98.666667  0.577350  98.0  98.50  99.0  99.00  99.0

In [28]:
pstore.groupby('country').litracy_rate.mean()

country
afghanistan    65.000000
bangla         98.000000
dubai          99.000000
england        99.000000
india          98.500000
pakistan       98.666667
Name: litracy_rate, dtype: float64